0/cladding/Q
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Q;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -3 0 0 0 0 ];

internalField   uniform 0; // Null source-term

boundaryField
{
    parede
    {
        type            symmetry;
    }
    extremos
    {
 	type		calculated;
    }
    inlet
    {
        type            calculated;
    }
    outlet
    {
        type            calculated;
    }

    cladding_to_coolant
    {
      type            calculated;
    }

    cladding_to_fuel
    {
      type            calculated;   
    }
}


// ************************************************************************* //
